nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN1_CLR

    /* store values for future usage */
    lcl_xcvr_hal_store_dcoc_cal(rate);
    
    DEBUG_PIN0_CLR

    return (status == gXcvrLclStatusSuccess ? HADM_HAL_SUCCESS : HADM_HAL_FAIL);
}

BLE_HADM_STATUS_t lcl_hadm_calibrate_pll(BLE_HADM_rttPhyMode_t rate)
{   
    xcvrLclStatus_t status = gXcvrLclStatusSuccess;
    XCVR_RSM_SQTE_RATE_T xcvr_rate = (XCVR_RSM_SQTE_RATE_T) (rate & 0x1);
    BLE_HADM_STATUS_t hal_status = HADM_HAL_SUCCESS;

    DEBUG_PIN0_SET

    /* Backup PLL config */
    lcl_hal_xcvr_pll_settings_backup();

#ifdef HADM_PLL_CAL_INTERPOLATION
    uint16_t chan40_ovrd;
    /* Trigger manual calibration on channel 40 */
    status = XCVR_LCL_MakeChanNumFromHadmIndex(40 /* 2442 MHz */, &chan40_ovrd);
    DEBUG_PIN1_SET
    status += XCVR_LCL_CalibratePll(&chan40_ovrd, (xcvr_lcl_pll_cal_data_t *)&hadm_device.cal_ch40[rate], 1, false, xcvr_rate);
    DEBUG_PIN1_CLR
#else

    /* Trigger manual calibration on all channels */
    uint16_t chan;
    uint16_t fstep_chan_num_ovrd[HADM_MAX_CHANNELS] = {0U};
    for (chan=0; chan < HADM_MAX_CHANNELS; chan++)
    {
        status += XCVR_LCL_MakeChanNumFromHadmIndex(chan, &fstep_chan_num_ovrd[chan]);
    }
    DEBUG_PIN1_SET
    status += XCVR_LCL_CalibratePll(fstep_chan_num_ovrd, (xcvr_lcl_pll_cal_data_t *)&hadm_device.cal_data[rate], HADM_MAX_CHANNELS, false, xcvr_rate);
    DEBUG_PIN1_CLR
#endif
    
    /* Restore PLL config */
    lcl_hal_xcvr_pll_settings_restore();

    if (gXcvrLclStatusSuccess == status)
    {
        /* Mark calibration as available */
        hal_status = HADM_HAL_SUCCESS;
    }
    else
    {
        hal_status = HADM_HAL_FAIL;
    }

    DEBUG_PIN0_CLR

    return hal_status;
}

const BLE_HADM_HalProperties_t *lcl_hadm_get_properties(void)
{
    return &hadm_hal_properties;
}

uint16 lcl_hadm_get_prepare_time(const BLE_HADM_SubeventConfig_t *hadm_config)
{
   (void)hadm_config;
   return hadm_hal_properties.prepareMaxUs;
}

const BLE_HADM_HalCapabilities_t *lcl_hadm_get_capabilities(void)
{
    return &hadm_hal_capabilities;
}

BLE_HADM_STATUS_t lcl_hadm_check_config(const BLE_HADM_SubeventConfig_t *hadm_config)
{   
    if((hadm_config->stepsNb > HADM_MAX_NB_STEPS) || (hadm_config->stepsNb < HADM_MIN_NB_STEPS))
        goto config_error;

    if (hadm_config->chModePmAntMap[0].mode != 0) /* First step shall be mode 0 */
        goto config_error;
    
    if (hadm_config->T_PM_Time > HADM_T_PM_40)
        goto config_error;
    
    if ((hadm_config->toneAntennaConfigIdx == HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time != HADM_T_SW_0)) /* N_AP=1 => T_SW=0 */
        goto config_error;
        
    if ((hadm_config->toneAntennaConfigIdx != HADM_ANT_CFG_IDX_0) && (hadm_config->T_SW_Time < HADM_T_SW_2)) /* only T_SW >1us is supported */
        goto config_error;

    if ((hadm_config->rttAntennaID == 0) || ((hadm_config->rttAntennaID > HADM_MAX_NB_ANTENNAS) && (hadm_config->rttAntennaID < 0xFE)))
        goto config_error;

    if (hadm_config->subeventIdx >= HADM_NUM_SUBEVENTS_MAX)
        goto config_error;
    
    if (hadm_config->connIdx >= HADM_MAX_NB_CONNECTIONS)
        goto config_error;

    return HADM_HAL_SUCCESS;
    
config_error:
    return HADM_HAL_INVALID_ARGS;
}

/* Make sure the execution of this function is not disruptive on any HW module (RSM, TSM, LCL, etc.) as it might be called while */
/* another measuremnt instance is running */
BLE_HADM_STATUS_t lcl_hadm_configure(const BLE_HADM_SubeventConfig_t *hadm_config)
{
    uint32_t i;
    xcvrLclStatus_t status;
    hadm_meas_t *hadm_meas_p = lcl_hadm_alloc_meas_instance();
    assert(NULL != hadm_meas_p);
    xcvr_lcl_rsm_config_t *rsm_config_p = &hadm_meas_p->rsm_config;
    int16_t mode0_timeout_usec;

    DEBUG_PIN0_SET

    if (!hadm_device.is_rsm_cal_done)
    {
        goto config_error; /* at this point all calibration must have ben performed */
    }

    hadm_meas_p->config_p = hadm_config; /* save config ptr */
    
    hadm_meas_p->debug_flags = hadm_config->debugFlags;
    
    /* Configure iq_avg_win according to T_PM: choose the closest smaller power of 2 to generate 4 IQ avg windows whatever
     * the configuration.
     * iq_avg_win is the number of samples (power of 2) per averaging window, based on
     *  4 samples per us when XCVR clocked for 1 Mbps
     *  8 samples per us when XCVR clocked for 2 Mbps
     * For instance with T_PM=20us: (4us)*4=16us with 4us of transition (discarded at start/end of T_PM)
     * - at 1 Mbps: 16 samples per avg window (4us)
     * - at 2 Mbps: 32 samples per avg window (4us)
     */

    switch (hadm_config->T_PM_Time)
    {
        case HADM_T_PM_40:
          hadm_meas_p->iq_avg_win = 5;
          break;
        case HADM_T_PM_20:
          hadm_meas_p->iq_avg_win = 4;
          break;
        case HADM_T_PM_10:
          hadm_meas_p->iq_avg_win = 3;
          break;
        default:
          goto config_error;
          break;
    }
    /* Capture window size in us, this will always result in 4 averaged values / AP / step */
    hadm_meas_p->iq_capture_win = (1 << hadm_meas_p->iq_avg_win);
#ifndef RSM_DBG_IQ
    if (hadm_meas_p->debug_flags & HADM_DBG_FLG_AVG_OFF)
#endif
    {
        hadm_meas_p->iq_avg_win = 0;
    }
#ifndef RSM_DBG_IQ
    else if (hadm_config->rttPhy == HADM_RTT_PHY_2MBPS)
    {
        /* Double IQ averaging window in order to get the same number of final (averaged) samples whatever the data rate */
        hadm_meas_p->iq_avg_win ++;
   }
#endif
    HADM_COMPUTE_NUM_ANTENNA(hadm_config->role, hadm_config->toneAntennaConfigIdx, hadm_meas_p->num_ant, hadm_meas_p->n_ap);
    
    /* Compute IQ buffer size */
    if (hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA)
    {
        lcl_hadm_utils_compute_iq_buff_size(hadm_config, hadm_meas_p, (hadm_config->rttPhy == HADM_RTT_PHY_2MBPS) ? (RX_SAMPLING_RATE*SAMPLING_RATE_FACTOR_2MBPS):RX_SAMPLING_RATE);
    }
    /* Compute step mode durations */
    lcl_hadm_utils_compute_step_duration(hadm_config, hadm_meas_p->n_ap, hadm_meas_p->step_duration);

