nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN0_CLR
}

/* === Implementation (static) ============================================= */

static void lcl_hadm_measurement_setup(hadm_proc_t *hadm_proc, hadm_meas_t *hadm_meas_p, const BLE_HADM_SubeventConfig_t *hadm_config)
{
#ifndef SIMULATOR
    lcl_hal_xcvr_hadm_init(hadm_meas_p, hadm_config);
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_config->role != HADM_ROLE_REFLECTOR)
    {
        /* In this mode, an additional per-step IRQ is setup with higher priority than RSM IRQ, in order to program CFO via Fast Override Module */
        lcl_hadm_enable_interrupts_for_subevent(hadm_config->role == HADM_ROLE_INITIATOR);
        /* FOM override occurs on fom_tx/tx_en which happens before TSM raises the IT, so will apply to the next step. */
        LCL_HAL_SET_PLL_OFFSET_FO_ENTRY();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
#endif /* SIMULATOR */
}

static void lcl_hadm_measurement_teardown(const BLE_HADM_SubeventConfig_t *hadm_config)
{
    lcl_hal_xcvr_hadm_deinit(hadm_config);
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
    if (hadm_config->role == HADM_ROLE_INITIATOR)
    {
        lcl_hadm_restore_interrupts_for_subevent();
    }
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */
}

static hadm_meas_t *lcl_hadm_alloc_meas_instance(void)
{
    hadm_meas_t *meas_p = NULL;
    for (int i=0; i<HADM_MAX_NB_SIMULT_SUBEVENTS ; i++)
    {
        if (hadm_meas[i].state == HADM_HAL_MEAS_STATE_IDLE)
        {
            meas_p = &hadm_meas[i];
            meas_p->config_p = NULL;
            meas_p->result_p = NULL;
            break;
        }
    }
    return meas_p;
}

static void lcl_hadm_free_meas_instance(hadm_meas_t *meas_p)
{
    meas_p->state = HADM_HAL_MEAS_STATE_IDLE;
    meas_p->config_p = NULL;
    meas_p->result_p = NULL;
}

static hadm_meas_t *lcl_hadm_get_meas_instance(const BLE_HADM_SubeventConfig_t *config_p)
{
    hadm_meas_t *meas_p = NULL;
    for (int i=0; i<HADM_MAX_NB_SIMULT_SUBEVENTS ; i++)
    {
        if (hadm_meas[i].config_p == config_p)
        {
            meas_p = &hadm_meas[i];
            break;
        }
    }
    return meas_p;
}

static void lcl_hadm_measurement_shutdown(hadm_meas_t *hadm_meas_p, bool_t abort_subevent)
{
#ifndef SIMULATOR
    /* Make sure all HW blocks are stopped */
    XCVR_LCL_RsmStopAbort(abort_subevent);
    LCL_HAL_STOP_LCL;
#ifndef RSM_DBG_IQ
    if (hadm_meas_p->debug_flags & HADM_DBG_FLG_IQ_DMA)
#endif
    {
        LCL_HAL_DISABLE_DMA;
    }
    lcl_hadm_measurement_teardown(hadm_meas_p->config_p);
    lcl_hadm_consume_drbg(hadm_meas_p);
#endif /* SIMULATOR */
}

/*!
 * This function is used to write subevent steps (#n_steps) configuration to PKT RAM Config circular buffer
 * This is called before subevent start (by BLE_HADM_SubeventConfigApply()) or by RSM step interrupt IRQ
 */
static BLE_HADM_STATUS_t lcl_hadm_set_steps_config(uint16 n_steps, hadm_meas_t *hadm_meas_p, bool_t update_rsm_ptr)
{
    uint32_t step_idx;
    hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_config;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[circ_buff_p->curr_step_idx];
#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
    bool_t compensate_cfo = (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR) && (hadm_proc->ppm != 0) && ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0);
#endif
    int16_t cfo = 0;
    uint8_t aa_offset = 1U - hadm_meas_p->config_p->role; /* offset to Rx AA */
    uint8_t cs_sync_ant_id = 0;
    
    DEBUG_PIN1_SET

    assert(circ_buff_p->curr_step_idx < hadm_meas_p->config_p->stepsNb);
    n_steps = MIN(n_steps, hadm_meas_p->config_p->stepsNb - circ_buff_p->curr_step_idx);

    for (step_idx = 0; step_idx < n_steps; step_idx++, step_config_p++)
    {
        if ((hadm_meas_p->pkt_ram.config_write_ptr + circ_buff_p->max_step_size) > circ_buff_p->base_ptr + circ_buff_p->buff_len)
        {
            /* Need to wrap now: rewind write pointer to start and toggle page */
            hadm_meas_p->pkt_ram.config_write_ptr = circ_buff_p->base_ptr;
            circ_buff_p->curr_page ^= 1U;
        }
        
        /* Compute HPM cal factor */
        uint16_t hpm_cal_val;
#ifdef HADM_PLL_CAL_INTERPOLATION
        if (step_config_p->mode == HADM_STEP_MODE2)
        {
            /* Per-step HPM cal not used for mode2 */
            hpm_cal_val = 0;
        }
        else /* mode 0, 1 or 3 */
        {
            /* Per-step HPM cal for packets - interpolated */
            hpm_cal_val = lcl_hadm_get_hpm_cal_interpolation(step_config_p->channel, hadm_device.cal_ch40[hadm_meas_p->config_p->rttPhy].hpm_cal_val);
        }
#else
        hpm_cal_val = hadm_device->cal_data[hadm_meas_p->config_p->rttPhy][step_config_p->channel].hpm_cal_val;
#endif
#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
        /* Compute CFO compensation */
        if (compensate_cfo && (step_config_p->mode != HADM_STEP_MODE0))
        {
            LCL_HAL_COMPUTE_STEP_CFO(cfo, hadm_proc->cfo_channel, step_config_p->channel, hadm_proc->ppm);

        }
#endif
        /* Compute CS_SYNC antenna ID to be used for this step */
        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            cs_sync_ant_id = lcl_hadm_utils_get_CS_SYNC_antenna(hadm_meas_p);
        }

        /* RSM timing requires TONE_EXT to be set for correct Stable Phase test TX timing */
        if (hadm_meas_p->rsm_config.op_mode == XCVR_RSM_SQTE_STABLE_PHASE_TEST_MODE)
        {
          step_config_p->pm_ext = 0x3U;
        }
        /* Build common config header to PKT RAM circular buffer */
        LCL_HAL_BUILD_PKT_RAM_CONFIG_STEP(step_config_p, hadm_meas_p->pkt_ram.config_write_ptr, cfo, hpm_cal_val, cs_sync_ant_id, hadm_meas_p->config_p->role);

        if (step_config_p->mode != HADM_STEP_MODE2)
        {
            uint32_t nb_words_written;
            BLE_HADM_rttType_t rtt_type = (step_config_p->mode == HADM_STEP_MODE0) ? HADM_RTT_TYPE_CS_AA_ONLY_TIMING : hadm_meas_p->config_p->rttTypes;

            /* Build AAs and payloads to PKT RAM circular buffer */
            DEBUG_PIN1_SET
            if (step_config_p->mode == HADM_STEP_MODE0)
            {
                /* For mode0, AAs have been computed in advanced and are available in HAL config buffer */
                nb_words_written = 2U; /* pn1 and pn2 */
                *hadm_meas_p->pkt_ram.config_write_ptr = hadm_meas_p->config_p->pnList[step_idx].pn1;
                *(hadm_meas_p->pkt_ram.config_write_ptr + 1U) = hadm_meas_p->config_p->pnList[step_idx].pn2;
            }
            else
            {
                /* For non-mode0, AAs and payloads have to be computed on the flight */
                nb_words_written = BLE_HADM_DRBG_Generate_CS_SYNC_step(hadm_meas_p->config_p->connIdx, hadm_meas_p->config_p->subeventIdx,
                                                                                circ_buff_p->curr_step_idx,
                                                                                rtt_type, hadm_meas_p->pkt_ram.config_write_ptr);
            }
            hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_w_idx].cs_sync_ant_id = cs_sync_ant_id;
            hadm_meas_p->pkt_ram_data_in_flight[hadm_meas_p->data_in_flight_w_idx].aa_rx = *(hadm_meas_p->pkt_ram.config_write_ptr + aa_offset);
#ifdef HADM_UT_MODE0_TIMEOUT
            if ((step_config_p->mode == HADM_STEP_MODE0) && (circ_buff_p->curr_step_idx < 2) && (hadm_meas_p->config_p->role == HADM_ROLE_REFLECTOR))
            {
                *(hadm_meas_p->pkt_ram.config_write_ptr) ^= 1;
            }
#endif
            hadm_meas_p->pkt_ram.config_write_ptr += nb_words_written;
            if (++hadm_meas_p->data_in_flight_w_idx >= HADM_HAL_PKT_RAM_IN_FLIGHT_DATA_BUFFER_SIZE)
            {
                hadm_meas_p->data_in_flight_w_idx = 0;
            }
            assert(hadm_meas_p->data_in_flight_w_idx != hadm_meas_p->data_in_flight_r_idx);
            DEBUG_PIN1_CLR
        }
        if (update_rsm_ptr)
        {
            LCL_HAL_UPDATE_PKT_RAM_CONFIG_STEP_PTR(circ_buff_p->curr_page, hadm_meas_p->pkt_ram.config_write_ptr);
        }
        circ_buff_p->curr_step_idx++;
    }
    
