nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    DEBUG_PIN1_CLR
          
    return HADM_HAL_SUCCESS;
}

/*
 * Brute force to consume DRBG context to re-sync after a missed subevent.
 * All DRBG transactions are consumed when preparing the procedure, except those below which are consumed as the subevent runs.
 * - CS_SYNC AA
 * - CS_SYNC payloads
 * Note that, for CS_SYNC AA, there is no need to resync since they are processed by chunks of 128 bits, so taBitsUsed is always 128
 * which will triger generation of new bits on next invocation.
 */
static void lcl_hadm_consume_drbg(hadm_meas_t *hadm_meas_p)
{
    uint32_t step_idx;

    DEBUG_PIN1_SET

    for (step_idx = hadm_meas_p->pkt_ram.step_config.curr_step_idx; step_idx < hadm_meas_p->config_p->stepsNb; step_idx++)
    {
        BLE_HADM_Chan_Mode_PmExt_AntPerm_t * step_config_p = &hadm_meas_p->config_p->chModePmAntMap[step_idx];
        if ((step_config_p->mode == HADM_STEP_MODE1) || (step_config_p->mode == HADM_STEP_MODE3))
        {
            /* Build AAs and payloads to PKT RAM circular buffer */
            (void) BLE_HADM_DRBG_Generate_CS_SYNC_step(hadm_meas_p->config_p->connIdx,
                                                        hadm_meas_p->config_p->subeventIdx,
                                                        step_idx,
                                                        hadm_meas_p->config_p->rttTypes,
                                                        NULL);
        }
    }
    hadm_meas_p->pkt_ram.step_config.curr_step_idx = hadm_meas_p->config_p->stepsNb;

    DEBUG_PIN1_CLR
}

/*!
 * This function is used to perform specific actions on last mode 0 reception:
 * - lock AGC
 * - Compute ppm (CFO)
 */
static BLE_HADM_STATUS_t lcl_hadm_handle_last_mode0(hadm_meas_t *hadm_meas_p)
{
    uint32_t step_idx;
    BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[0];
    hadm_info_t *hadm_info_p = &hadm_meas_p->info;
    hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
    uint8_t mode0Nb = hadm_meas_p->config_p->mode0Nb;
    bool_t proc_agc_locked = (hadm_proc->agc_idx != 0xFF);
    bool_t subevent_synced = FALSE;

    hadm_sync_info_t *sync_info_p = &hadm_meas_p->sync_info[0];
    BLE_HADM_STATUS_t status;
    
    DEBUG_PIN1_SET

    /* Select best mode0 (smallest AGC index to limit IQ saturation) */
    for (step_idx = 0; step_idx < mode0Nb; step_idx++, sync_info_p++)
    {        
        if (sync_info_p->valid)
        {
            subevent_synced = TRUE;

            /* If procedure has not locked its AGC yet (didn't get a subevent with at least one valid mode0) */
            /* look for smallest gain amongst valid mode 0's */
            if (!proc_agc_locked)
            {
                if (hadm_proc->agc_idx > sync_info_p->agc_idx)
                {
                    hadm_info_p->sync_step_id = step_idx;
                    /* Record AGC index and keep the smallest */
                    hadm_proc->agc_idx = sync_info_p->agc_idx;
                    /* Record the estimated CFO and channel used for CFO estimation */
                    hadm_proc->cfo = sync_info_p->cfo;
                    hadm_proc->cfo_channel = step_config_p[step_idx].channel;
                }
            }
        }
    }

    if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
    {
        /* If procedure has not locked its AGC yet (didn't get a subevent with at least one valid mode0) */
        /* look for smallest gain amongst valid mode 0's on sniffer's reflector channel */
        if (!proc_agc_locked)
        {
            hadm_sync_info_t *sync_info2_p = &hadm_meas_p->sync_info2[0];
            for (step_idx = 0; step_idx < mode0Nb; step_idx++, sync_info2_p++)
            {
                if (hadm_proc->agc_idx2 > sync_info2_p->agc_idx)
                {
                    /* Record AGC index and keep the smallest */
                    hadm_proc->agc_idx2 = sync_info2_p->agc_idx;
                    /* Override the estimated CFO and channel used for CFO estimation, use Reflector device CFO */
                    hadm_proc->cfo = sync_info2_p->cfo;
                    hadm_proc->cfo_channel = step_config_p[step_idx].channel;
                }
            }
        }
    }

    if (!proc_agc_locked)
    {
        /* Compute ppm based on measured CFO */
        hadm_proc->ppm = (int16_t)((hadm_proc->cfo * HADM_PPM_DIVIDER)/ ((int32_t)HADM_CHAN_NUM_TO_MHZ(hadm_proc->cfo_channel)));
    }

    if (subevent_synced)
    {
        /* Freeze AGC according to the index from the retained mode 0 */
        lcl_hal_xcvr_set_rxgain(hadm_proc->agc_idx);
        if (hadm_meas_p->config_p->role == HADM_ROLE_SNIFFER)
        {
            lcl_hal_xcvr_set_rxgain2(hadm_proc->agc_idx2);
        }

        /* fallback to one shot RSSI */
        lcl_hal_xcvr_setup_rssi_continuous(false); 

        /* Compute CFO & time grid adjustment */
        if (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR)
        {
            if ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0)
            {
#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
                /* Enable FOM entry trigger for next step */
                LCL_HAL_ENABLE_FO_ENTRY();
                /* Compute CFO compensation to apply at next step */
                int32_t cfo;
                LCL_HAL_COMPUTE_CHANNEL_CFO(cfo, hadm_meas_p->config_p->chModePmAntMap[mode0Nb].channel, hadm_proc->ppm);
                lcl_hadm_apply_cfo_per_step(cfo);
#else
                /* Initial CFO compensation */
                XCVR_LCL_RsmCompCfo(-hadm_proc->cfo);
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

#ifdef HADM_CFO_COMP_PER_STEP_VIA_PKTRAM
                /* Update CFO programmed for already-built config steps */
                /* At this point only 1 step has been prepared in addition of the mode 0 steps */
                hadm_circ_buff_desc_t *circ_buff_p = &hadm_meas_p->pkt_ram.step_result;
                int16_t step_cfo;
                step_idx = mode0Nb + 1U;

