nxp-mcuxpresso/mcuxsdk-middleware-bluetooth-controller/src/hadm/kw47_mcxw72x_nbu/lcl_hadm_measurement.c
    /* CLear IRQ status flags */
    LCL_HAL_RSM_SET_IRQ_STATUS_FLAGS(irq_status);
    
    /* Notify LL */
    DEBUG_PIN1_SET
    if (HADM_EVENT_INVALID != type)
    {
        BLE_HADM_NotifyLL(hadm_meas_p->result_p, type, hal_status);
    }
    DEBUG_PIN1_CLR

    if (type == HADM_EVENT_EOS)
    {
        if (hadm_meas_p->config_p->typeFlags & HADM_SUBEVT_LAST)
        {
            /* End of procedure, clean context */
            hadm_procs[hadm_meas_p->config_p->connIdx].is_proc_init_done = false;
        }
        lcl_hadm_free_meas_instance(hadm_meas_p);
        hadm_device.active_meas_p = NULL;
    }

    DEBUG_PIN0_CLR
}

#ifdef HADM_CFO_COMP_PER_STEP_VIA_FOM
void BRF_INT_IRQHandler(void)
{
    uint32_t irq_status = XCVR_MISC->XCVR_STATUS;

    if ((irq_status & XCVR_MISC_XCVR_STATUS_TSM_IRQ0_MASK) != 0)
    {
        /* Write one to clear status bit */
        XCVR_MISC->XCVR_STATUS = XCVR_MISC_XCVR_STATUS_TSM_IRQ0_MASK;
        hadm_meas_t *hadm_meas_p = hadm_device.active_meas_p;
        hadm_proc_t *hadm_proc = &hadm_procs[hadm_meas_p->config_p->connIdx];
        bool_t compensate_cfo = (hadm_meas_p->config_p->role != HADM_ROLE_REFLECTOR) && (hadm_proc->ppm != 0) && ((hadm_meas_p->debug_flags & HADM_DBG_FLG_CFO_COMP_DIS) == 0);

        if (compensate_cfo)
        {
            uint32_t rsm_curr_step = ((XCVR_MISC->RSM_CSR & XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_MASK) >> XCVR_MISC_RSM_CSR_RSM_CURRENT_STEPS_SHIFT);
            /* Prepare CFO for next step */
            rsm_curr_step ++;
            if ((rsm_curr_step > hadm_meas_p->config_p->mode0Nb) && (rsm_curr_step < hadm_meas_p->config_p->stepsNb))
            {
                BLE_HADM_Chan_Mode_PmExt_AntPerm_t *step_config_p = &hadm_meas_p->config_p->chModePmAntMap[rsm_curr_step];
                int32_t cfo;
                LCL_HAL_COMPUTE_CHANNEL_CFO(cfo, step_config_p->channel, hadm_proc->ppm);
                lcl_hadm_apply_cfo_per_step(cfo);
            }
        }
    }

}
#endif /* HADM_CFO_COMP_PER_STEP_VIA_FOM */

/* EOF */